Core/src/DataProcessors/DigiSMВесыСПечатьюЭтикеток/DigiSMВесыСПечатьюЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>DigiSMВесыСПечатьюЭтикеток</name>
  <comment>Обработка осуществляет обслуживание весов с печатью этикеток, поддерживаемых драйвером «Digi SM OLE»</comment>
  <tabularSections>
    <name>ТабНоменклатуры</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PLU</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодПолный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/DataProcessors/DigiSMВесыСПечатьюЭтикеток/ObjectModule.bsl
#Если Клиент Тогда

///////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мНетОшибки;
Перем мОшибкаПараметровНастройки;
Перем мОшибкаЗагрузкиДрайвера;
Перем мОшибкаНеизвестно;
Перем мОшибкаТестНеПройден;

Перем мПрефиксВТ;
Перем мПрефиксШТ;

Перем мИдентификатор;
Перем мВерсияОбработки;

Перем мФорматЕтикетки;
Перем мФорматШтрихкода;
Перем мКодоваяСтраница;
Перем мНаименованиеМагазина;
Перем IPадрес;

///////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ (ОБЩИЕ ФУНКЦИИ API)

// Функция возвращает номер версии API, поддерживаемой обработкой обслуживания.
//
// Номер версии задаётся следующим образом: Ver = Vmajor + Vminor / 100.0.
// Например, в случае, если данная функция возвращает значение «1.01», это
// означает, что данная обработка  имеет версию «1.1», полностью поддерживает
// версию «1.0» и содержит некоторые дополнительные элементы.
// В случае, если отличается целая часть версии (например, «2.1»), то это
// означает, что данная обработка несовместима с версией API «1.0».
//
// Функция является обязательной для любой версии API.
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <Число> - Версия API обработки обслуживания.
//
//
Функция ПолучитьВерсиюAPI() Экспорт

	Результат = 2.05;
	Возврат Результат;

КонецФункции // ПолучитьВерсиюAPI()

// Функция возвращает описание текущей обработки обслуживания (API v2.0).
//
// Данная функция позволяет серверу получить информацию об обработке
// обслуживания. Функция является обязательной для версий 1.X API.
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  <Структура> - Структура, содержащая описание текущей обработки.
//                Структура имеет следующие поля:
//
//                Вид              - <ПеречислениеСсылка.ВидыТорговогоОборудования>
//                                 - Вид торгового оборудования, поддерживаемый
//                                   данной обработкой обслуживания.
//
//                СписокМоделей    - <Массив>
//                                 - Список поддерживаемых обработкой моделей
//                                   торгового оборудования.
//
//                Наименование     - <Строка>
//                                 - Наименование обработки обслуживания.
//
//                Описание         - <Строка>
//                                 - Описание обработки обслуживания.
//
//                ВерсияОбработки  - <Число>
//                                 - Номер версии обработки обслуживания
//                                   (не версии API!!!).
//                                   Данный параметр используется при
//                                   обновлении.
//                                   Номер версии задаётся следующим образом:
//                                   Ver = Vmajor + Vminor / 100.0.
//
Функция ПолучитьОписание() Экспорт

	мМодели = Новый Массив;
	мМодели.Добавить("DIGI-SM");

	Результат                 = Новый Структура("Вид, СписокМоделей, Наименование,
	                                            |Описание, ВерсияОбработки,
	                                            |Идентификатор");
	мМетаданные               = Метаданные();
	Попытка
		Результат.Вид             = Перечисления.ВидыТорговогоОборудования.ВесыСПечатьюЭтикеток;
	Исключение
		Результат.Вид             = Перечисления.ВидыТорговогоОборудования.ЭлектронныеВесыOffline;
	КонецПопытки;
	Результат.СписокМоделей   = мМодели;
	Результат.Наименование    = мМетаданные.Синоним;
	Результат.Описание        = мМетаданные.Комментарий;
	Результат.ВерсияОбработки = мВерсияОбработки;
	Результат.Идентификатор   = мИдентификатор;

	Возврат Результат;

КонецФункции // ПолучитьОписание()

// Функция создаёт объект драйвера.
// (API v2.0)
//
// Параметры:
//  Объект                         - <*>
//                                 - Выходной параметр; объект драйвера торгового
//                                   оборудования.
//
//  Модель                         - <Строка>
//                                 - Модель торгового оборудования, для которой
//                                   создаётся экземпляр драйвера.
//
//  Параметры                      - <Строка>
//                                 - Параметры подключаемого торгового оборудования.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция СоздатьОбъектДрайвера(Объект, Модель, Параметры) Экспорт

	// Инициализация переменных
	Результат = мНетОшибки;
	ИДУстройства = Неопределено;
	ОписаниеОшибки = "";
	Объект    = Неопределено;

	IPадрес             	= Неопределено;
	мФорматЕтикетки			= 17;
	мФорматШтрихкода		= 4;	
	мКодоваяСтраница		= 1251;
	мНаименованиеМагазина	= "";

	// Получение значений параметров
	Параметры.Свойство("IPадрес", IPадрес);
	Параметры.Свойство("ФорматЕтикетки", мФорматЕтикетки);
	Параметры.Свойство("ФорматШтрихкода", мФорматШтрихкода);
	Параметры.Свойство("КодоваяСтраница", мКодоваяСтраница);
	Параметры.Свойство("НаименованиеМагазина", мНаименованиеМагазина);

	Если IPадрес = Неопределено Тогда
		Результат = мОшибкаПараметровНастройки;
	Иначе
		Попытка
			ПрогИД = "DigiSM.TDigiSM";
			Драйвер = Новый COMОбъект(ПрогИД);
			Драйвер.IPAddress = СокрЛП(IPадрес);
		Исключение
			Результат = мОшибкаЗагрузкиДрайвера;
			ОписаниеОшибки = "Невозможно подключить OLE драйвер.
			| Проверьте, что OLE драйвер корректно установлен.";
		КонецПопытки;

		Если Результат = мНетОшибки Тогда
			Объект = Новый Структура("Модель, Параметры, Драйвер, ОписаниеОшибки",
			                          Модель, Параметры, Драйвер, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции // СоздатьОбъектДрайвера()

// Функция возвращает набор событий драйвера и параметры их обработки для
// заданной модели торгового оборудования.
// (API v2.0)
//
// Параметры:
//  Объект            - <*>
//                    - Объект драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <ТаблицаЗначений> - Таблица значений, содержащая информацию о внешних
//                      событиях, генерируемых драйвером.
//                      Таблица имеет следующие колонки:
//                       "ИмяСобытия" - <Строка> - Имя внешнего события.
//
Функция ПолучитьОписаниеСобытий(Объект) Экспорт

	Таблица = Новый ТаблицаЗначений;

	Таблица.Колонки.Добавить("ИмяСобытия");

	Возврат Таблица;

КонецФункции // ПолучитьОписаниеСобытий()

// Функция осуществляет подключение устройства.
// (API v2.0)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция Подключить(Объект) Экспорт

	Результат = мНетОшибки;

	Попытка
		Объект.Драйвер.Connect = Истина;
	Исключение
		Объект.ОписаниеОшибки = ОписаниеОшибки();
		Результат = мОшибкаНеизвестно;
	КонецПопытки;
	
	Если НЕ Объект.Драйвер.Connect Тогда
		Объект.ОписаниеОшибки = "Не удалось установить соединение с весами.";
		Результат = мОшибкаНеизвестно;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // Подключить()

// Процедура осуществляет отключение устройства.
// (API v2.0)
//
// Параметры:
//  Объект - <*>
//         - Объект драйвера торгового оборудования.
//
Процедура Отключить(Объект) Экспорт

	Результат = мНетОшибки;

	Если НЕ Объект.Драйвер.Connect Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект.Драйвер.Connect = Ложь;
	Исключение
		Объект.ОписаниеОшибки = ОписаниеОшибки();
		Результат = мОшибкаНеизвестно;
	КонецПопытки;

КонецПроцедуры // Отключить()

// Функция осуществляет проверку правильности настройки и подключения
// торгового оборудования.
// (API v2.0)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера устройства, проверка
//                                   которого предполагается.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
&НаСервере
Функция ТестУстройства(Объект) Экспорт

	Результат          = мНетОшибки;
	Объект.ОписаниеОшибки = "";

	Результат = Подключить(Объект);

	Если Результат <> мНетОшибки Тогда
		Результат          = мОшибкаТестНеПройден;
	КонецЕсли;
	
	Отключить(Объект);

	Возврат Результат;

КонецФункции // ТестУстройства()

// Процедура осуществляет вызов формы настройки торгового оборудования.
// (API v2.0)
//
// Параметры:
//  Модель    - <Строка>
//            - Модель настраиваемого оборудования.
//
//  Параметры - <Структура>
//            - Входной/выходной параметр; структура параметров.
//
Процедура НастроитьОборудование(Модель, Параметры) Экспорт

	Форма            = ПолучитьФорму("ФормаНастройки");
	Форма.мМодель    = Модель;
	Форма.мПараметры = Параметры;
	Ответ            = Форма.ОткрытьМодально();

	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Параметры = Форма.мПараметры;
	КонецЕсли;

КонецПроцедуры // НастроитьОборудование()

// Функция возвращает имя источника внешнего события 
// генерируемое при подключеннии внешней компонентой.
// По уникальному для сеанса подключения имени производится поиск 
// из конфигурации обработки обслуживания для обработки полученного
// события.
// (API v2.1)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера устройства.
//
// Возвращаемое значение:
//  <Строка> - Имя внешнего источника события.
//
Функция ПолучитьИмяИсточникаВнешнегоСобытия(Объект) Экспорт

	Возврат "";

КонецФункции

///////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ (ФУНКЦИИ API ОБРАБОТОК ОБСЛУЖИВАНИЯ ВЕСОВ С ПЕЧАТЬЮ ЭТИКЕТОК)

// Функция осуществляет инициализацию процедуры выгрузки данных в весы с печатью этикеток.
// (API v2.3)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  ЧастичнаяВыгрузка              - <Булево>
//                                 - Признак частичной выгрузки товара
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция НачатьВыгрузку(Объект, ЧастичнаяВыгрузка = Ложь) Экспорт

	Результат = мНетОшибки;
	
	Результат = Подключить(Объект);

	Если Результат <> мНетОшибки Тогда
		Возврат Результат;
	КонецЕсли;
	
	//мМагазин = мНаименованиеМагазина;
	//мМагазин = СтрЗаменить(мМагазин,"і","i");
	//мМагазин = СтрЗаменить(мМагазин,"І","I");
	//
	//мНомЗапись 					= 0;
	//
	//Пока мНомЗапись>=0 Цикл
	//
	//	мНомЗапись 					= Объект.Драйвер.ReadShopName(мНомЗапись,Истина);
	//	
	//	Если мНомЗапись<0 Тогда
	//		Прервать;
	//	КонецЕсли;		
	//	
	//	Объект.Драйвер.ShopName 	= мМагазин;
	//	nКодОшибки					= Объект.Драйвер.WriteShopName(мНомЗапись);

	//	//Если nКодОшибки<0 Тогда
	//	//
	//	//	мОписаниеОшибки = "Помилка встановлення назви магазину #"+Формат(nКодОшибки,"ЧГ=0");
	//	//	
	//	//	Если nКодОшибки>=-6 Тогда 
	//	//		мОписаниеОшибки = мОписаниеОшибки + ": Недостатньо ОЗУ.";
	//	//	ИначеЕсли nКодОшибки>=-5 Тогда
	//	//		мОписаниеОшибки = мОписаниеОшибки + ": Помилка запису.";
	//	//	Иначе
	//	//		мОписаниеОшибки = мОписаниеОшибки + ": Невідома помилка.";
	//	//	КонецЕсли;
	//	//	
	//	//	Объект.ОписаниеОшибки = мОписаниеОшибки;
	//	//	
	//	//	Результат = мОшибкаНеизвестно;
	//	//	
	//	//	Прервать;
	//	//
	//	//КонецЕсли;	
	//	
	//КонецЦикла;
				
	Возврат Результат;

КонецФункции // НачатьВыгрузку()

Функция ПерекодироватьТест(мИсходнаяСтрока,мИзКодировки,мВКодировку)

	Перем Текст, ИмяФайла, мРезультат;
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(мИсходнаяСтрока);
	Текст.Записать(ИмяФайла,мИзКодировки);
	Текст.Прочитать(ИмяФайла,мВКодировку);
	
	мРезультат = Текст.ПолучитьТекст();
	
	Возврат мРезультат;

КонецФункции // ПерекодироватьТест()

Функция ПолучитьШтрихкод(КодТовара,Длина=13)

	мДлинаКода = ?(мФорматШтрихкода=4,6,5);
	мДлинаКолв = Длина-?(мФорматШтрихкода=4,8,7);
	мДлинаКолв = ?(мДлинаКолв<0,0,мДлинаКолв);
	
	мШтрихкод = Лев(мПрефиксВТ + Формат(КодТовара,"ЧЦ="+мДлинаКода+"; ЧВН=; ЧГ=0") + "0000000000000000000000000000000000000",Длина);
	
	Возврат мШтрихкод;

КонецФункции // ПолучитьШтрихкод()


// Функция осуществляет выгрузку позиции в весы с печатью этикеток.
// (API v2.0)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  PLU                            - <Число>
//                                 - Номер PLU.
//
//  КодТовара                      - <Число>
//                                 - Код товара.
//
//  Наименование                   - <Строка>
//                                 - Наименование номенклатуры.
//
//  Цена                           - <Число>
//                                 - Цена номенклатуры.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция Выгрузить(Объект, PLU, КодТовара, Наименование, Цена, СрокГодности=0) Экспорт

	Результат = мНетОшибки;
	
	мНаименование = Наименование;
	
	мНаименование = СтрЗаменить(мНаименование,"і","i");
	мНаименование = СтрЗаменить(мНаименование,"І","I");

	Если мКодоваяСтраница<>1251 Тогда
		мНаименование = ПерекодироватьТест(мНаименование,КодировкаТекста.ANSI,КодировкаТекста.OEM);
	КонецЕсли;
	
	Объект.Драйвер.InitPLU();
	Объект.Драйвер.NumLine 			= 1;
	Объект.Драйвер.PLUName 			= Сред(мНаименование,1,24);
	Объект.Драйвер.NumLine 			= 2;
	Объект.Драйвер.PLUName 			= Сред(мНаименование,25,24);
	Объект.Драйвер.LabelFormat1 	= мФорматЕтикетки;
	Объект.Драйвер.BarcodeFormat 	= мФорматШтрихкода;
	Объект.Драйвер.UnitPrice 		= Окр(Цена*100,0);
	Объект.Драйвер.Weighed 			= Истина;
	Объект.Драйвер.EANData 			= ПолучитьШтрихкод(КодТовара,13);
	
	Если СрокГодности>0 Тогда
		Объект.Драйвер.SellByDate 		= Формат(СрокГодности,"ЧЦ=3; ЧВН=; ЧГ=0");
		Объект.Драйвер.PackedDate 		= "000";
		Объект.Драйвер.UsedByDate 		= Формат(СрокГодности,"ЧЦ=3; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	//nКодОшибки 						= Объект.Драйвер.WritePLU(PLU); 
	nКодОшибки 						= Объект.Драйвер.WritePLU(КодТовара); 

	Если nКодОшибки>=0 Тогда
		Возврат Результат;
	КонецЕсли;	
	
	мОписаниеОшибки = "Помилка #"+Формат(nКодОшибки,"ЧГ=0");
	
	Если nКодОшибки>=-6 Тогда 
		мОписаниеОшибки = мОписаниеОшибки + ": Недостатньо ОЗУ.";
	ИначеЕсли nКодОшибки>=-5 Тогда
		мОписаниеОшибки = мОписаниеОшибки + ": Помилка запису.";
	Иначе
		мОписаниеОшибки = мОписаниеОшибки + ": Невідома помилка.";
	КонецЕсли;
	
	Объект.ОписаниеОшибки = мОписаниеОшибки;
	
	Результат = мОшибкаНеизвестно;

	Возврат Результат;
	
КонецФункции // Выгрузить()

// Функция осуществляет деинициализацию процедуры выгрузки данных в весы с печатью этикеток.
// (API v2.0)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция ЗавершитьВыгрузку(Объект) Экспорт

	Результат = мНетОшибки;
	
	Отключить(Объект);
	
	Возврат Результат;

КонецФункции // ЗавершитьВыгрузку()

// Функция осуществляет выгрузку таблицы товаров в весы с печатью этикеток.
// (API v2.3)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  Товары                         - <ТаблицаЗначений>
//                                 - Таблица товаров для выгрузки в весы.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция ВыгрузитьТаблицу(Объект, Товары) Экспорт

	Результат = мНетОшибки;

	Результат = НачатьВыгрузку(Объект);
	
	Если Результат = мНетОшибки Тогда
		
		Для каждого Товар Из Товары Цикл
			
			Если НЕ Товар.Выгружать Тогда
				Продолжить;
			КонецЕсли;

			НаименованиеТовара = ПредставлениеТовара(Товар);
			Результат = Выгрузить(Объект, Товар.PLU,
			                              Товар.PLU,
			                              НаименованиеТовара,
			                              Товар.Цена);
			Если Результат <> мНетОшибки Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

		Результат = ЗавершитьВыгрузку(Объект);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции // Выгрузить()

&НаСервере
// Функция осуществляет очистку таблицы товаров в весы с печатью этикеток.
// (API v2.3)
//
// Параметры:
//  Объект                         - <*>
//                                 - Объект драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <ПеречислениеСсылка.ТООшибки*> - Результат работы функции.
//
Функция ОчиститьТоварыВВесах(Объект) Экспорт

	Результат = мНетОшибки;

	Результат = НачатьВыгрузку(Объект);
	
	Если Результат = мНетОшибки Тогда
	
		nКодОшибки = Объект.Драйвер.DeleteTable(37); 

		Если nКодОшибки<0 Тогда
			
			мОписаниеОшибки = "Помилка #"+Формат(nКодОшибки,"ЧГ=0");
			
			Если nКодОшибки>=-1 Тогда 
				мОписаниеОшибки = мОписаниеОшибки + ": Недостатньо ОЗУ.";
			ИначеЕсли nКодОшибки>=-4 Тогда
				мОписаниеОшибки = мОписаниеОшибки + ": Помилка видалення.";
			ИначеЕсли nКодОшибки>=-3 Тогда 
				мОписаниеОшибки = мОписаниеОшибки + ": Немає таблиці з таким номером.";
			Иначе
				мОписаниеОшибки = мОписаниеОшибки + ": Невідома помилка.";
			КонецЕсли;
			
			Объект.ОписаниеОшибки = мОписаниеОшибки;
			
			Результат = мОшибкаНеизвестно;
			
		КонецЕсли;	
		
		Результат = ЗавершитьВыгрузку(Объект);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции // ОчиститьТоварыВВесах()

///////////////////////////////////////////////////////////////////////////////
//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует представление товара
//
// Параметры
//  Выборка  – <ВыборкаИзРезультатаЗапроса > – Исходные данные
//
// Возвращаемое значение:
//   Строка - Описание характеристик ТМЦ
//
Функция ПредставлениеТовара(Выборка)

	Результат = "";
	Если Выборка.ХарактеристикаНоменклатуры <> Неопределено
	   И Выборка.ХарактеристикаНоменклатуры <> "" Тогда
		Результат = Результат + " (" + Выборка.ХарактеристикаНоменклатуры + ")";
	КонецЕсли;

	Результат = Выборка.Номенклатура.Наименование + Результат;

	Возврат Результат;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мНетОшибки                 	= Перечисления.ТООшибкиОбщие.ПустаяСсылка();
мОшибкаПараметровНастройки 	= Перечисления.ТООшибкиОбщие.ОшибкаПараметровНастройки;
мОшибкаЗагрузкиДрайвера    	= Перечисления.ТООшибкиОбщие.ОшибкаЗагрузкиДрайвера;
мОшибкаНеизвестно          	= Перечисления.ТООшибкиОбщие.ОшибкаНеизвестно;
мОшибкаТестНеПройден       	= Перечисления.ТООшибкиОбщие.ОшибкаТестНеПройден;
мПрефиксВТ                 	= "2" + Константы.ПрефиксВесовогоТовара.Получить();
мПрефиксШТ                 	= "2" + Константы.ПрефиксШтучногоТовара.Получить();

мИдентификатор   			= Новый УникальныйИдентификатор;
мВерсияОбработки 			= 2.22;

мФорматЕтикетки			   	= 17;
мФорматШтрихкода			= 4;
мКодоваяСтраница			= 1251;
мНаименованиеМагазина		= "";

#КонецЕсли
